import axios from 'axios'

let handler = async (m, { conn }) => {

  const horarioFecha = new Date().toLocaleString('es-CO', {
    timeZone: 'America/Bogota'
  })

  const labelTest = "𝐌𝐄𝐋𝐈𝐎𝐃𝐀𝐒 - 𝐁𝐎𝐓"
  const imgUrl = "https://cdn.dix.lat/me/b0216efd-5f4a-4f5a-97bf-b62a81d10014.jpg"
  const videoUrl = "https://cdn.dix.lat/me/be57966c-c848-4b75-ae07-89b3ddde95a4.mp4"

  let fakeQuoted = m

  try {
    const response = await axios.get(imgUrl, {
      responseType: 'arraybuffer'
    }).catch(() => null)

    if (response) {
      const thumbBuffer = response.data

      fakeQuoted = {
        key: {
          participant: '0@s.whatsapp.net',
          remoteJid: 'status@broadcast',
          fromMe: false,
          id: 'KiritoTest'
        },
        message: {
          locationMessage: {
            name: labelTest,
            jpegThumbnail: thumbBuffer
          }
        },
        participant: '0@s.whatsapp.net'
      }
    }
  } catch (e) {
    console.error(e)
  }

  let menu = `*¡Hola!* 🔰 @${m.sender.split('@')[0]}
\`\`\`${horarioFecha}\`\`\`

╭━━━━━━⋆◈⋆━━⬣
┃ ❙❘❙❙❘❙❚❙❘❙❙❚❙❘❙❘❙❚❙❘❙❙❚❙❘❙❙❘❙❚❙❘ 
┃ ⏤͟͟͞͞𝗖𝗥𝗘𝗔𝗗𝗢𝗥:
┃ 📿 +573223702049
┃ ❙❘❙❙❘❙❚❙❘❙❙❚❙❘❙❘❙❚❙❘❙❙❚❙❘❙❙❘❙❚❙❘ 
╰━━━━━━⋆◈⋆━━⬣

╭━━━[ 𝗠𝗘𝗡𝗨𝗦 🐉]━⬣
 
¡*sᴜᴍᴇ́ʀɢᴇᴛᴇ ᴇɴ ᴇsᴛᴀ ᴀᴠᴇɴᴛᴜʀᴀ ᴅᴇʟ ᴍᴇɴᴜ ᴅᴇ Mᴇʟɪᴏᴅᴀs ʙᴏᴛ*.!
┈┈┈┈┈┈┈┈┈┈┈⌲
┊📚➺ .𝗺𝗲𝗻𝘂𝗳𝗿𝗲𝗲𝗳𝗶𝗿𝗲
┊📚➺ .𝗺𝗲𝗻𝘂𝗮𝗻𝗶𝗺𝗲𝘀
┊📚➺ .𝗺𝗲𝗻𝘂𝗷𝘂𝗲𝗴𝗼𝘀
┊📚➺ .𝗺𝗲𝗻𝘂𝗹𝗼𝗴𝗼𝘀
┊📚➺ .𝗺𝗲𝗻𝘂𝗶𝗺𝗴
┊📚➺ .𝗺𝗲𝗻𝘂𝗵𝗼𝘁
╰━━━━━━⋆◈⋆━━⬣

╭━[ 𝗥𝗘𝗚𝗟𝗔𝗦 𝗪𝗢𝗥𝗗 🎖️]━⬣
*Mᴜɴᴅᴏ ꜰʀᴇᴇ ꜰɪʀᴇ ʀᴇɢʟᴀs Wᴏʀᴅ*
┈┈┈┈┈┈┈┈┈┈┈
┊📏➺ .𝗿𝗲𝗴𝗹𝗮𝘀𝘄𝗼𝗿𝗱
╰━━━━━━⋆◈⋆━━⬣

╭━━━[ 𝗧𝗜𝗞 𝗧𝗢𝗞 🎥 ]━⬣
*Dɪsꜰʀᴜᴛᴀ ᴇʟ ᴄᴀᴛᴀ́ʟᴏɢᴏ ᴅᴇ ᴛɪᴋ ᴛᴏᴋ* 📷 📹
┈┈┈┈┈┈┈┈┈┈┈┈
┊🦖➺ .𝗯𝘂𝘀𝗰𝗮𝗿𝘁𝗶𝗸𝘁𝗼𝗸 𝘁𝗲𝘅𝘁𝗼
┊🦖➺ .𝘁𝗶𝗸𝘁𝗼𝗸𝗿𝗮𝗻𝗱𝗼𝗺
┊🦖➺ .𝘁𝗶𝗸𝘁𝗼𝗸𝗺𝘂𝘀𝗶𝗰
┊🦖➺ .𝘁𝗶𝗸𝘁𝗼𝗸𝗳𝗿𝗮𝘀𝗲𝘀
┊🦖➺ .𝘁𝗶𝗸𝘁𝗼𝗸𝘃𝗮𝗹𝗹𝗲
┊🦖➺ .𝘁𝗶𝗸𝘁𝗼𝗸𝗵𝗼𝘁
╰━━━━━━⋆◈⋆━━⬣

╭━[ 𝗗𝗜𝗡𝗔𝗠𝗜𝗖 🎠 ]━⬣
*Rᴇᴀʟɪᴢᴀ ᴀᴄᴄɪᴏɴᴇs ᴄᴏɴ ɢɪꜰs Eᴛɪǫᴜᴇᴛᴀɴᴅᴏ ᴀ ᴀʟɢᴜɪᴇɴ*
┈┈┈┈┈┈┈┈┈┈┈┈
┊🎠➺ .𝗽𝗲𝗻𝗲𝘁𝗿𝗮𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗴𝗼𝗹𝗽𝗲𝗮𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗮𝗯𝗿𝗮𝘇𝗮𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗰𝗼𝗴𝗲𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗯𝗲𝘀𝗮𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗳𝗼𝗹𝗹𝗮𝗿 𝘁𝗮𝗴
┊🎠➺ .𝘀𝗮𝗹𝘂𝗱𝗮𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗯𝗮𝗶𝗹𝗮𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗰𝗲𝗻𝗮𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗮𝗻𝗴𝗿𝘆 𝘁𝗮𝗴
┊🎠➺ .𝗲𝗻𝗼𝗷𝗮𝗱𝗼 𝘁𝗮𝗴
┊🎠➺ .𝗮𝗯𝘂𝗿𝗿𝗶𝗱𝗼 𝘁𝗮𝗴
┊🎠➺ .𝗮𝗽𝗹𝗮𝘂𝗱𝗶𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗹𝗹𝗼𝗿𝗮𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗯𝗼𝗿𝗿𝗮𝗰𝗵𝗼 𝘁𝗮𝗴
┊🎠➺ .𝗰𝗼𝗺𝗲𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗽𝗮𝗹𝗺𝗮𝗱𝗮 𝘁𝗮𝗴
┊🎠➺ .𝗳𝗲𝗹𝗶𝘇 𝘁𝗮𝗴
┊🎠➺ .𝗺𝗮𝘁𝗮𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗿𝗲𝗶𝗿𝘀𝗲 𝘁𝗮𝗴
┊🎠➺ .𝗯𝗼𝗳𝗲𝘁𝗮𝗱𝗮 𝘁𝗮𝗴
┊🎠➺ .𝘀𝗹𝗲𝗲𝗽 𝘁𝗮𝗴
┊🎠➺ .𝗱𝗼𝗿𝗺𝗶𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗽𝗶𝘀𝗮𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗽𝗲𝗻𝘀𝗮𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗽𝗮𝗹𝗺𝗮𝗱𝗮 𝘁𝗮𝗴
┊🎠➺ .𝗴𝗼𝗹𝗽𝗲𝗮𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗲𝗺𝗯𝗮𝗿𝗮𝘇𝗮𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗰𝗼𝗿𝗿𝗲𝗿 𝘁𝗮𝗴
┊🎠➺ .𝘀𝗮𝗱 𝘁𝗮𝗴
┊🎠➺ .𝘁𝗿𝗶𝘀𝘁𝗲 𝘁𝗮𝗴
┊🎠➺ .𝗮𝘀𝘂𝘀𝘁𝗮𝗱𝗮 𝘁𝗮𝗴
┊🎠➺ .𝗮𝘀𝘂𝘀𝘁𝗮𝗱𝗼 𝘁𝗮𝗴
┊🎠➺ .𝘁𝗶𝗺𝗶𝗱𝗼 𝘁𝗮𝗴
┊🎠➺ .𝘁𝗶𝗺𝗶𝗱𝗮 𝘁𝗮𝗴
┊🎠➺ .𝗰𝗮𝗺𝗶𝗻𝗮𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗱𝗿𝗮𝗺𝗮 𝘁𝗮𝗴
┊🎠➺ .𝗴𝘂𝗶𝗻̃𝗮𝗿 𝘁𝗮
┊🎠➺ .𝗽𝗿𝗲𝘀𝘂𝗺𝗶𝗿 𝘁𝗮𝗴
┊🎠➺ .𝘀𝗼𝗻𝗿𝗲𝗶𝗿 𝘁𝗮𝗴
┊🎠➺ .𝗺𝗮𝗻𝗼 𝘁𝗮𝗴
┊🎠➺ .𝗯𝘂𝗹𝗹𝘆𝗶𝗻𝗴 𝘁𝗮𝗴
┊🎠➺ .𝗵𝗼𝗹𝗮 𝘁𝗮𝗴
╰━━━━━━⋆◈⋆━━⬣

╭━━[ 𝗣𝗔𝗥𝗘𝗝𝗔𝗦 👩🏻‍❤️‍👨🏻]━⬣
 ¡ *Dᴇᴄʟᴀ́ʀᴀᴛᴇ ᴄᴏɴ ᴀʟɢᴜɪᴇɴ    ᴘᴀʀᴀ ǫᴜᴇ sᴇᴀɴ ᴘᴀʀᴇᴊᴀs* !
┈┈┈┈┈┈┈┈┈┈┈┈
┊💘➺ .𝗺𝗶𝗻𝗼𝘃𝗶𝗮 𝘁𝗮𝗴
┊💘➺ .𝗺𝗶𝗻𝗼𝘃𝗶𝗼 𝘁𝗮𝗴
┊💘➺ .𝘀𝗲𝗿𝗻𝗼𝘃𝗶𝗼𝘀 𝘁𝗮𝗴
┊💘➺ .𝗲𝗻𝗮𝗺𝗼𝗿𝗮𝗿 𝘁𝗮𝗴
┊💘➺ .𝗮𝗺𝗼𝗿 𝘁𝗮𝗴
┊💘➺ .𝗳𝗼𝗿𝗺𝗮𝗿𝗽𝗮𝗿𝗲𝗷𝗮
┊💘➺ .𝘁𝗼𝗽𝗽𝗮𝗿𝗲𝗷𝗮𝘀
┊💘➺ .𝗮𝗺𝗶𝘀𝘁𝗮𝗱
┊💘➺ .𝗹𝗼𝘃𝗲 𝘁𝗮𝗴
╰━━━━━━⋆◈⋆━━━━⬣

╭━━━[ 𝗙𝗥𝗘𝗘 𝗙𝗜𝗥𝗘 🎮]━⬣ ¡ *Jᴜᴇɢᴀs ꜰʀᴇᴇ ꜰɪʀᴇ ᴄᴏɴ ᴛᴜs ᴀᴍɪɢᴏs* !
────────────
» 𝗟𝗜𝗦𝗧𝗔𝗦 𝗩𝗦 «
┊🇧🇷➺ .𝟭𝘃𝘀𝟭
┊🇧🇷➺ .𝟰𝘃𝘀𝟰 𝗵𝗼𝗿𝗮
┊🇧🇷➺ .𝟲𝘃𝘀𝟲 𝗵𝗼𝗿𝗮
┊🇧🇷➺ .𝟴𝘃𝘀𝟴 𝗵𝗼𝗿𝗮
┊🇧🇷➺ .𝟭𝟮𝘃𝘀𝟭𝟮 𝗵𝗼𝗿𝗮
┊🇧🇷➺ .𝟭𝟲𝘃𝘀𝟭𝟲 𝗵𝗼𝗿𝗮
┊🇧🇷➺ .𝟮𝟬𝘃𝘀𝟮𝟬 𝗵𝗼𝗿𝗮
┊🏴‍☠️➺ .𝗶𝗻𝘁𝗲𝗿𝗻𝗮𝟰𝘃𝘀𝟰 𝗵𝗼𝗿𝗮
┊🏴‍☠️➺ .𝗶𝗻𝘁𝗲𝗿𝗻𝗮𝟲𝘃𝘀𝟲 𝗵𝗼𝗿𝗮
┊🇦🇶➺ .𝘀𝗰𝗿𝗶𝗺
┊🇦🇶➺ .𝘀𝗰𝗿𝗶𝗺𝗱𝘂𝗼
┊🇦🇶➺ .𝗺𝗮𝗽𝗮𝗰𝘂𝗮𝗱𝗿𝗶𝗹𝗮𝘁𝗲𝗿𝗼
┊🇦🇶➺ .𝗹𝗶𝘀𝘁𝗮𝗰𝘂𝗮𝗱𝗿𝗶𝗹𝗮𝘁𝗲𝗿𝗼
┊🇦🇶➺ .𝗺𝗮𝗽𝗮𝗵𝗲𝘅𝗮𝗴𝗼𝗻𝗮𝗹
┊🇦🇶➺ .𝗹𝗶𝘀𝘁𝗮𝗵𝗲𝘅𝗮𝗴𝗼𝗻𝗮𝗹 
────────────
» 𝗠𝗔𝗣𝗔𝗦 𝗙𝗥𝗘𝗘 𝗙𝗜𝗥𝗘 «
┊🗼➺ .𝗯𝗲𝗿𝗺𝘂𝗱𝗮
┊🏝️➺ .𝗽𝘂𝗿𝗴𝗮𝘁𝗼𝗿𝗶𝗼
┊🏜️➺ .𝗸𝗮𝗹𝗮𝗵𝗮𝗿𝗶 
┊🏗️➺ .𝗻𝗲𝘅𝘁𝗲𝗿𝗿𝗮
┊🏞️➺ .𝗮𝗹𝗽𝗲𝘀
────────────
» 𝙀𝙉𝘾𝙐𝙀𝙎𝙏𝘼 «
┊⚙️➺ .𝗲𝗻𝗰𝘂𝗲𝘀𝘁𝗮
» 𝗔𝗥𝗠𝗔𝗥 𝗦𝗤𝗨𝗔𝗗 
┊🌟➺ .𝗰𝗹𝗮𝘀𝗶𝗳𝗶𝗰𝗮𝘁𝗼𝗿𝗶𝗮
┊🌟➺ .𝗱𝘂𝗲𝗹𝗼
┊🌟➺ .𝗱𝘂𝗼
┊🌟➺ .𝗰𝗼𝗺𝗽𝗲
» 𝗡𝗢𝗩𝗔𝗧𝗢𝗦 «
┊🗣️➺ .𝗺𝗮𝗻𝗰𝗮 𝘁𝗮𝗴
┊🗣️➺ .𝗺𝗮𝗻𝗰𝗼 𝘁𝗮𝗴
╰━━━━━━⋆◈⋆━━⬣

╭━[ 𝗙𝗥𝗔𝗦𝗘𝗦 🥀 ]━⬣
*Qᴜɪᴇɴ ɴᴏ ᴀʀʀɪᴇsɢᴀ ᴘɪᴇʀᴅᴇ*.
┈┈┈┈┈┈┈┈┈┈┈┈┈
┊🥀➺ .𝗳𝗿𝗮𝘀𝗲𝗿𝗼𝗺𝗮𝗻𝘁𝗶𝗰𝗮
┊🥀➺ .𝗽𝗲𝗿𝘀𝗼𝗻𝗮𝗹𝗶𝗱𝗮𝗱 𝘁𝗮𝗴
┊🥀➺ .𝗰𝗼𝗻𝘀𝗲𝗷𝗼
┊🥀➺ .𝗳𝗿𝗮𝘀𝗲𝘀
┊🥀➺ .𝗽𝗶𝗿𝗼𝗽𝗼
┊🥀➺ .𝗰𝗮𝗺𝗮𝗿𝗮
┊🥀➺ .𝗳𝗮𝗰𝘁𝗼
╰━━━━━━⋆◈⋆━━⬣

╭━[ 𝗗𝗘𝗦𝗖𝗔𝗥𝗚𝗔𝗦  🎥]━⬣

*Dɪsꜰʀᴜᴛᴀ ᴇʟ ᴄᴏɴᴛᴇɴɪᴅᴏ ᴅᴇ ᴅᴇsᴄᴀʀɢᴀs ᴅᴇ EBG*
┈┈┈┈┈┈┈┈┈┈┈┈┈┈
┊⚡️➺ .𝗮𝗽𝗸 | 𝗻𝗼𝗺𝗯𝗿𝗲 𝗮𝗽𝗸
┊⚡️➺ .𝗽𝗶𝗻𝘁𝗲𝗿𝗲𝘀𝘁 | 𝘁𝗲𝘅𝘁𝗼
┊⚡️➺ .𝗽𝗹𝗮𝘆 | 𝘁𝗲𝘅𝘁𝗼 𝗼 𝗹𝗶𝗻𝗸
┊⚡️➺ .𝘆𝘁𝗺𝗽𝟯 | 𝗹𝗶𝗻𝗸
┊⚡️➺ .𝘆𝘁𝗺𝗽𝟰 | 𝗹𝗶𝗻𝗸
┊⚡️ .𝘀𝗽𝗼𝘁𝗶𝗳𝘆 | 𝘁𝗲𝘅𝘁𝗼
┊⚡️➺ .𝘁𝘄𝗶𝘁𝘁𝗲𝗿 | 𝗹𝗶𝗻𝗸
┊⚡️➺ .𝗳𝗮𝗰𝗲𝗯𝗼𝗼𝗸 | 𝗹𝗶𝗻𝗸
┊⚡️➺ .𝗶𝗻𝘀𝘁𝗮𝗴𝗿𝗮𝗺 | 𝗹𝗶𝗻𝗸
┊⚡️➺ .𝘁𝗶𝗸𝘁𝗼𝗸 | 𝗹𝗶𝗻𝗸
┊⚡️➺ .𝗺𝗲𝗱𝗶𝗮𝗳𝗶𝗿𝗲 | 𝗹𝗶𝗻𝗸
┊⚡️➺ .𝗴𝗶𝗳
┊⚡️➺ .𝘀𝗽𝗼𝘁𝗶𝗳𝘆𝘀𝗲𝗮𝗿𝗰𝗵
╰━━━━━━⋆◈⋆━━⬣

╭━[  𝗜𝗔 🌟 ]━⬣

*Cᴏɴᴠᴇʀsᴀʀ ᴄᴏɴ Mᴇʟɪᴏᴅᴀs Bᴏᴛ*
┈┈┈┈┈┈┈┈┈┈┈┈┈
┊🪄➺ .𝗺𝗲𝘁𝗮
┊🪄➺ .𝗴𝗲𝗺𝗶𝗻𝗶
┊🪄➺ .𝗰𝗵𝗮𝘁𝗴𝗽𝘁 𝗽𝗿𝗲𝗴𝘂𝗻𝘁𝗮 
╰━━━━━━⋆◈⋆━━⬣

╭━[ 𝗦𝗧𝗜𝗖𝗞𝗘𝗥𝗦 🖼️ ]━⬣

*Pᴇʀsᴏɴᴀʟɪᴢᴀ ʟᴀ ɪɴꜰᴏʀᴍᴀᴄɪᴏ́ɴ ᴅᴇʟ Sᴛɪᴄᴋᴇʀ.*
┈┈┈┈┈┈┈┈┈┈┈┈┈┈
┊🔮➺ .𝗾𝗰
┊🔮➺ .𝗯𝗿𝗮𝘁
┊🔮➺ .𝗯𝗿𝗮𝘁𝘃
┊🔮➺ .𝗲𝗺𝗼𝗷𝗶𝗺𝗶𝘅
┊🔮➺ .𝘄𝗺 𝘁𝗲𝘅𝘁𝗼 
┊🔮➺ .𝘀
╰━━━━━━⋆◈⋆━━⬣

╭━[ 𝗖𝗢𝗡𝗩𝗘𝗥𝗧𝗜𝗗𝗢𝗥𝗘𝗦 ]━⬣

*Cᴏɴᴠɪᴇʀᴛᴇ sᴛɪᴄᴋᴇʀ ᴇɴ ɪᴍᴀɢᴇɴ  Cʀᴇᴀ ᴇɴʟᴀᴄᴇ ᴅᴇ ᴀʀᴄʜɪᴠᴏs.*
┈┈┈┈┈┈┈┈┈┈┈┈┈
┊🔰➺ .𝗵𝗱 𝗶𝗺𝗮𝗴𝗲𝗻 
┊🔰➺ .𝗽𝗻𝗴 
┊🔰➺ .𝘁𝗼𝗶𝗺𝗴 𝘀𝘁𝗶𝗰𝗸𝗲𝗿
┊🔰➺ .𝘁𝗼𝗴𝗶𝗳 𝘃𝗶𝗱𝗲𝗼 
┊🔰➺ .𝘁𝗼𝘂𝗿𝗹 𝗶𝗺𝗴 𝗼 𝘃𝗶𝗱𝗲𝗼 
╰━━━━━━⋆◈⋆━━⬣

╭━[ 𝗔𝗝𝗨𝗦𝗧𝗘𝗦 ]━⬣

*Cᴏɴꜰɪɢᴜʀᴀ sɪ ᴇʀᴇs ᴀᴅᴍɪɴ*
┈┈┈┈┈┈┈┈┈┈┈┈
┊⚙️ .𝘰𝘯 : 𝘰𝘧𝘧 𝘄𝗲𝗹𝗰𝗼𝗺𝗲 
┊⚙️ .𝘰𝘯 : 𝘰𝘧𝘧 𝗻𝘀𝗳𝘄 
┊⚙️ .𝘰𝘯 : 𝘰𝘧𝘧 𝗮𝗻𝘁𝗶𝗹𝗶𝗻𝗸
┊⚙️ .𝘰𝘯 : 𝘰𝘧𝘧 𝗱𝗲𝘁𝗲𝗰𝘁
┊⚙️ .𝘰𝘯 : 𝘰𝘧𝘧 𝗺𝗼𝗱𝗼𝗮𝗱𝗺𝗶𝗻
╰━━━━━━⋆◈⋆━━⬣

╭━[ 𝗚𝗥𝗨𝗣𝗢 🏘️ ]━⬣

*Mᴇᴊᴏʀᴀ ᴛᴜ́ Gʀᴜᴘᴏ ᴄᴏɴ MELⵊODAS BOT*
┈┈┈┈┈┈┈┈┈┈┈┈
┊🐉➺ _.𝗺𝘂𝘁𝗲
┊🐉➺ _.𝘂𝗻𝗺𝘂𝘁𝗲
┊🐉➺ _.𝗸𝗶𝗰𝗸 𝙩𝙖𝙜
┊🐉➺ _.𝗴𝗿𝘂𝗽𝗼 𝗮𝗯𝗿𝗶𝗿 
┊🐉➺ _.𝗴𝗿𝘂𝗽𝗼 𝗰𝗲𝗿𝗿𝗮𝗿
┊🐉➺ _.𝗽𝗿𝗼𝗺𝗼𝘁𝗲 𝘁𝗮𝗴
┊🐉➺ _.𝗱𝗲𝗺𝗼𝘁𝗲 𝘁𝗮𝗴
┊🐉➺ _.𝘁𝗼𝗱𝗼𝘀 
┊🐉➺ _.𝗻 𝘁𝗲𝘅𝘁𝗼  
┊🐉➺ _.𝗲𝗻𝗰𝘂𝗲𝘀𝘁𝗮 𝘁𝗲𝘅𝘁𝗼
┊🐉➺ _.𝘢𝘣𝘳𝘪𝘳𝘨𝘳𝘶𝘱𝘰𝘦𝘯 𝘩𝘰𝘳𝘢
┊🐉➺ _.𝘤𝘦𝘳𝘳𝘢𝘳𝘨𝘳𝘶𝘱𝘰𝘦𝘯𝘩𝘰𝘳𝘢
┊🐉➺ _.𝗹𝗶𝗻𝗸
┊🐉➺ _.𝗱𝗲𝗹
┊🐉➺ _.𝗿𝗼𝗯𝗮𝗿𝗴𝗿𝘂𝗽𝗼
┊🐉➺ _.𝘀𝗲𝘁𝗳𝗼𝘁𝗼𝗴𝗿𝘂𝗽𝗼
┊🐉➺ _.𝘀𝗲𝘁𝗻𝗮𝗺𝗲𝗴𝗿𝘂𝗽𝗼
┊🐉➺ _.𝘀𝗲𝘁𝘄𝗲𝗹𝗰𝗼𝗺𝗲 𝘁𝗲𝘅𝘁𝗼 
╰━━━━━━⋆◈⋆━━⬣

╭━[ 𝗣𝗥𝗢𝗣𝗜𝗘𝗧𝗔𝗥𝗜𝗢 ]━⬣

*Cᴏᴍᴀɴᴅᴏs sᴏʟᴏ ᴘᴀʀᴀ Pʀᴏᴘɪᴇᴛᴀʀɪᴏ*
┈┈┈┈┈┈┈┈┈┈┈
┊📿➺ .𝗽𝗶𝗻𝗴
┊📿➺ .𝗷𝗼𝗶𝗻
┊📿➺ .𝗱𝗮𝗺𝗲𝗮𝗱𝗺𝗶𝗻
┊📿➺ .𝗰𝗿𝗲𝗮𝗱𝗼𝗿
┊📿➺ .𝘁𝗲𝗻𝗲𝗿𝗽𝗼𝗱𝗲𝗿
┊📿➺ .𝗲𝘀𝘁𝗮𝗱𝗼
┊📿➺ .𝘂𝗽𝗱𝗮𝘁𝗲
┊📿➺ .𝘁𝗶𝗲𝗺𝗽𝗼 
┊📿➺ .𝗯𝗮𝗻𝗰𝗵𝗮𝘁
┊📿➺ .𝘂𝗻𝗯𝗮𝗻𝗰𝗵𝗮𝘁
┊📿➺ .𝘀𝗲𝘁𝗳𝗼𝘁𝗼𝗯𝗼𝘁
┊📿➺ .𝘀𝗲𝘁𝗻𝗮𝗺𝗲𝗯𝗼𝘁
╰━━━━━━⋆◈⋆━━⬣
`

  await conn.sendMessage(
    m.chat,
    {
      video: { url: videoUrl },
      gifPlayback: true,
      caption: menu,
      mentions: [m.sender],
      contextInfo: {
        forwardingScore: 1,
        isForwarded: true,
        forwardedNewsletterMessageInfo: {
          newsletterJid: global.ch || '120363419404216418@newsletter',
          newsletterName: '↯ 𝘔𝘌𝘓𝘐𝘖𝘋𝘈𝘚 𝘉𝘖𝘛 - 𝘊𝘏𝘈𝘕𝘕𝘌𝘓 𝟮𝟬𝟮𝟯'
        }
      }
    },
    { quoted: fakeQuoted }
  )
}

handler.help = ['menu']
handler.tags = ['main']
handler.command = ['menu']

export default handler
